{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "1abbf814",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ch02-downloaded.pdf already exists, skipping download.\n"
     ]
    }
   ],
   "source": [
    "# Get and extract the pdf file we want to chat with.\n",
    "\n",
    "import os\n",
    "import requests\n",
    "\n",
    "remote_pdf_url = \"https://arxiv.org/pdf/1709.00666.pdf\"\n",
    "pdf_filename = \"ch02-downloaded.pdf\"\n",
    "\n",
    "if not os.path.exists(pdf_filename):\n",
    "    response = requests.get(remote_pdf_url)\n",
    "\n",
    "    if response.status_code == 200:\n",
    "        with open(pdf_filename, \"wb\") as pdf_file:\n",
    "            pdf_file.write(response.content)\n",
    "    else:\n",
    "        print(\"Failed to download the PDF. Status code:\", response.status_code)\n",
    "else:\n",
    "    print(f\"{pdf_filename} already exists, skipping download.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "5854a9eb",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pdfplumber\n",
    "\n",
    "text = \"\"\n",
    "with pdfplumber.open(pdf_filename) as pdf:\n",
    "    for page in pdf.pages:\n",
    "        text += page.extract_text()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "3e37f5c6",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Save the text as text file\n",
    "with open(\"extracted_text.md\", \"w\", encoding=\"utf-8\") as md_file:\n",
    "    md_file.write(text)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "17ba3084",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load the text here. \n",
    "# Later, the code can be run from here. No need to extract the pdf again.\n",
    "with open(\"extracted_text.md\", \"r\", encoding=\"utf-8\") as md_file:\n",
    "    loaded_text = md_file.read()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "2e9a2a74",
   "metadata": {},
   "outputs": [],
   "source": [
    "# chunk creator\n",
    "def chunk_text(text, chunk_size, overlap, split_on_whitespace_only=True):\n",
    "    chunks = []\n",
    "    index = 0\n",
    "\n",
    "    while index < len(text):\n",
    "        if split_on_whitespace_only:\n",
    "            prev_whitespace = 0\n",
    "            left_index = index - overlap\n",
    "            while left_index >= 0:\n",
    "                if text[left_index] == \" \":\n",
    "                    prev_whitespace = left_index\n",
    "                    break\n",
    "                left_index -= 1\n",
    "            next_whitespace = text.find(\" \", index + chunk_size)\n",
    "            if next_whitespace == -1:\n",
    "                next_whitespace = len(text)\n",
    "            chunk = text[prev_whitespace:next_whitespace].strip()\n",
    "            chunks.append(chunk)\n",
    "            index = next_whitespace + 1\n",
    "        else:\n",
    "            start = max(0, index - overlap + 1)\n",
    "            end = min(index + chunk_size + overlap, len(text))\n",
    "            chunk = text[start:end].strip()\n",
    "            chunks.append(chunk)\n",
    "            index += chunk_size\n",
    "\n",
    "    return chunks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "0efc7353",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "89\n"
     ]
    }
   ],
   "source": [
    "chunks = chunk_text(loaded_text, 500, 40)\n",
    "print(len(chunks)) # 89 chunks in total"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dc6612bf",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Now we embed the the chunks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "6c54938d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "from openai import OpenAI\n",
    "\n",
    "load_dotenv(override=True)  # loads .env into environment variables\n",
    "\n",
    "# Use OpenRouter API key and base URL\n",
    "client = OpenAI(\n",
    "    api_key=os.getenv(\"OPENROUTER_API_KEY\"),\n",
    "    base_url=\"https://openrouter.ai/api/v1\"\n",
    ")\n",
    "\n",
    "def embed(texts, model=\"openai/text-embedding-3-small\"):\n",
    "    response = client.embeddings.create(\n",
    "        input=texts,\n",
    "        model=model,\n",
    "    )\n",
    "    return list(map(lambda n: n.embedding, response.data))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "e4e16de5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x00000293B5908690>, keys=[])"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Connect with Neo4j. I am using local\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "from openai import OpenAI\n",
    "load_dotenv(override=True) \n",
    "\n",
    "driver = GraphDatabase.driver(\n",
    "    os.getenv(\"NEO4J_URI\"),\n",
    "    auth=(os.getenv(\"NEO4J_USERNAME\"), os.getenv(\"NEO4J_PASSWORD\"))\n",
    ")\n",
    "\n",
    "embeddings = embed(chunks)\n",
    "\n",
    "driver.execute_query(\"\"\"CREATE VECTOR INDEX pdf IF NOT EXISTS\n",
    "FOR (c:Chunk) \n",
    "ON c.embedding\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "c2b37099",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x00000293B1277360>, keys=[])"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from openai import OpenAI\n",
    "load_dotenv(override=True) \n",
    "\n",
    "driver = GraphDatabase.driver(\n",
    "    os.getenv(\"NEO4J_URI\"),\n",
    "    auth=(os.getenv(\"NEO4J_USERNAME\"), os.getenv(\"NEO4J_PASSWORD\"))\n",
    ")\n",
    "\n",
    "existing_records, _, _ = driver.execute_query(\n",
    "    \"MATCH (c:Chunk) WHERE c.embedding IS NOT NULL RETURN c.index AS idx, c.embedding AS embedding\"\n",
    ")\n",
    "existing_embeddings = {record[\"idx\"]: record[\"embedding\"] for record in existing_records}\n",
    "\n",
    "embeddings = [existing_embeddings.get(i) for i in range(len(chunks))]\n",
    "missing_indexes = [i for i, emb in enumerate(embeddings) if emb is None]\n",
    "\n",
    "if missing_indexes:\n",
    "    missing_texts = [chunks[i] for i in missing_indexes]\n",
    "    new_embeddings = embed(missing_texts)\n",
    "    for idx, emb in zip(missing_indexes, new_embeddings):\n",
    "        embeddings[idx] = emb\n",
    "        driver.execute_query(\n",
    "            \"MATCH (c:Chunk {index: $idx}) SET c.embedding = $embedding\",\n",
    "            idx=idx,\n",
    "            embedding=emb,\n",
    "        )\n",
    "\n",
    "driver.execute_query(\"\"\"CREATE VECTOR INDEX pdf IF NOT EXISTS\n",
    "FOR (c:Chunk) \n",
    "ON c.embedding\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e4c70b9f",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Add to neo4j\n",
    "cypher_query = '''\n",
    "WITH $chunks as chunks, range(0, size($chunks)) AS index\n",
    "UNWIND index AS i\n",
    "WITH i, chunks[i] AS chunk, $embeddings[i] AS embedding\n",
    "MERGE (c:Chunk {index: i})\n",
    "SET c.text = chunk, c.embedding = embedding\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "36a1a08b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x00000293B1276EA0>, keys=[])"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver.execute_query(cypher_query, chunks=chunks, embeddings=embeddings)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "283302b4",
   "metadata": {
    "vscode": {
     "languageId": "markdown"
    }
   },
   "outputs": [],
   "source": [
    "# You should be able to see the data in neo4j now. You can run the following query to check. \n",
    "# MATCH (n) RETURN n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "a974b2b3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Einstein’s Patents and Inventi\n",
      "[0.025200437754392624, -0.023198649287223816, -0.013963400386273861]\n"
     ]
    }
   ],
   "source": [
    "records, _, _ = driver.execute_query(\"MATCH (c:Chunk) WHERE c.index = 0 RETURN c.embedding, c.text\")\n",
    "\n",
    "print(records[0][\"c.text\"][0:30])\n",
    "print(records[0][\"c.embedding\"][0:3])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "88ca330c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CH‐Switzerland\n",
      "Considering Einstein’s upbringing, his interest in inventions and patents was not unusual.\n",
      "Being a manufacturer’s son, Einstein grew upon in an environment of machines and instruments.\n",
      "When his father’s company obtained the contract to illuminate Munich city during beer festival, he\n",
      "was actively engaged in execution of the contract. In his ETH days Einstein was genuinely interested\n",
      "in experimental works. He wrote to his friend, “most of the time I worked in the physical laboratory,\n",
      "fascinated by the direct contact with observation.” Einstein's\n",
      "0.8111178278923035 42\n",
      "======\n",
      "Einstein\n",
      "left his job at the Patent office and joined the University of Zurich on October 15, 1909. Thereafter, he\n",
      "continued to rise in ladder. In 1911, he moved to Prague University as a full professor, a year later, he\n",
      "was appointed as full professor at ETH, Zurich, his alma‐mater. In 1914, he was appointed Director of\n",
      "the Kaiser Wilhelm Institute for Physics (1914–1932) and a professor at the Humboldt University of\n",
      "Berlin, with a special clause in his contract that freed him from teaching obligations. In the meantime,\n",
      "he was working for\n",
      "0.7977417707443237 31\n",
      "======\n",
      "Einstein’s life was rather featureless. He diligently worked at the patent office,\n",
      "played violin, discussed physics with his friends, write few not so interesting papers. Then in 1905, he\n",
      "took the academic world by surprise. In the annals of physics, the year 1905 is known as “annus\n",
      "mirabilis” or the year of miracle. Indeed, a miracle happened. Albert Einstein, barely 26 years old,\n",
      "sitting in an obscure Swiss patent office, wrote four papers, each of which produced some sort of\n",
      "revolution in Physics. The papers were published in a single\n",
      "0.7873095870018005 20\n",
      "======\n",
      "in nuances of machines and instruments. However, it must also be\n",
      "emphasized that his main occupation was theoretical physics. The inventions he worked upon were\n",
      "his diversions. In his unproductive times he used to work upon on solving mathematical problems (not\n",
      "related to his ongoing theoretical investigations) or took upon some practical problem. As shown in\n",
      "Table. 2, Einstein was involved in three major inventions; (i) refrigeration system with Leo Szilard, (ii)\n",
      "Sound reproduction system with Rudolf Goldschmidt and (iii) automatic camera\n",
      "0.7871673107147217 44\n",
      "======\n"
     ]
    }
   ],
   "source": [
    "question = \"At what time was Einstein really interested in experimental works?\"\n",
    "question_embedding = embed([question])[0]\n",
    "\n",
    "query = '''\n",
    "CALL db.index.vector.queryNodes('pdf', $k, $question_embedding) YIELD node AS hits, score\n",
    "RETURN hits.text AS text, score, hits.index AS index\n",
    "'''\n",
    "similar_records, _, _ = driver.execute_query(query, question_embedding=question_embedding, k=4)\n",
    "\n",
    "for record in similar_records:\n",
    "    print(record[\"text\"])\n",
    "    print(record[\"score\"], record[\"index\"])\n",
    "    print(\"======\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "4695329a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Question: At what time was Einstein really interested in experimental works?\n",
      "According to the documents provided, Einstein was genuinely interested in experimental works during his time at ETH, a Swiss university."
     ]
    }
   ],
   "source": [
    "system_message = \"You're en Einstein expert, but can only use the provided documents to respond to the questions.\"\n",
    "user_message = f\"\"\"\n",
    "Use the following documents to answer the question that will follow:\n",
    "{[doc[\"text\"] for doc in similar_records]}\n",
    "\n",
    "---\n",
    "\n",
    "The question to answer using information only from the above documents: {question}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Question:\", question)\n",
    "\n",
    "stream = client.chat.completions.create(\n",
    "    model=\"gpt-4\",\n",
    "    messages=[\n",
    "        {\"role\": \"system\", \"content\": system_message},\n",
    "        {\"role\": \"user\", \"content\": user_message}\n",
    "    ],\n",
    "    stream=True,\n",
    ")\n",
    "for chunk in stream:\n",
    "    print(chunk.choices[0].delta.content or \"\", end=\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "ec734fa8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fulltext Index already exists\n"
     ]
    }
   ],
   "source": [
    "try :\n",
    "    driver.execute_query(f\"CREATE FULLTEXT INDEX ftPdfChunk FOR (c:Chunk) ON EACH [c.text]\")\n",
    "except:\n",
    "    print(\"Fulltext Index already exists\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "84697965",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N00', status_description='warn: feature deprecated. CALL subquery without a variable scope clause is deprecated. Use CALL () { ... }', position=<SummaryInputPosition line=2, column=1, offset=1>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 1, 'line': 2, 'column': 1}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"\\nCALL {\\n    // vector index\\n    CALL db.index.vector.queryNodes('pdf', $k, $question_embedding) YIELD node, score\\n    WITH collect({node:node, score:score}) AS nodes, max(score) AS max\\n    UNWIND nodes AS n\\n    // We use 0 as min\\n    RETURN n.node AS node, (n.score / max) AS score\\n    UNION\\n    // keyword index\\n    CALL db.index.fulltext.queryNodes('ftPdfChunk', $question, {limit: $k})\\n    YIELD node, score\\n    WITH collect({node:node, score:score}) AS nodes, max(score) AS max\\n    UNWIND nodes AS n\\n    // We use 0 as min\\n    RETURN n.node AS node, (n.score / max) AS score\\n}\\n// dedup\\nWITH node, max(score) AS score ORDER BY score DESC LIMIT $k\\nRETURN node, score\\n\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CH‐Switzerland\n",
      "Considering Einstein’s upbringing, his interest in inventions and patents was not unusual.\n",
      "Being a manufacturer’s son, Einstein grew upon in an environment of machines and instruments.\n",
      "When his father’s company obtained the contract to illuminate Munich city during beer festival, he\n",
      "was actively engaged in execution of the contract. In his ETH days Einstein was genuinely interested\n",
      "in experimental works. He wrote to his friend, “most of the time I worked in the physical laboratory,\n",
      "fascinated by the direct contact with observation.” Einstein's\n",
      "1.0 42\n",
      "======\n",
      "Einstein\n",
      "left his job at the Patent office and joined the University of Zurich on October 15, 1909. Thereafter, he\n",
      "continued to rise in ladder. In 1911, he moved to Prague University as a full professor, a year later, he\n",
      "was appointed as full professor at ETH, Zurich, his alma‐mater. In 1914, he was appointed Director of\n",
      "the Kaiser Wilhelm Institute for Physics (1914–1932) and a professor at the Humboldt University of\n",
      "Berlin, with a special clause in his contract that freed him from teaching obligations. In the meantime,\n",
      "he was working for\n",
      "0.983509107199952 31\n",
      "======\n",
      "Einstein’s life was rather featureless. He diligently worked at the patent office,\n",
      "played violin, discussed physics with his friends, write few not so interesting papers. Then in 1905, he\n",
      "took the academic world by surprise. In the annals of physics, the year 1905 is known as “annus\n",
      "mirabilis” or the year of miracle. Indeed, a miracle happened. Albert Einstein, barely 26 years old,\n",
      "sitting in an obscure Swiss patent office, wrote four papers, each of which produced some sort of\n",
      "revolution in Physics. The papers were published in a single\n",
      "0.9706476173105838 20\n",
      "======\n",
      "in nuances of machines and instruments. However, it must also be\n",
      "emphasized that his main occupation was theoretical physics. The inventions he worked upon were\n",
      "his diversions. In his unproductive times he used to work upon on solving mathematical problems (not\n",
      "related to his ongoing theoretical investigations) or took upon some practical problem. As shown in\n",
      "Table. 2, Einstein was involved in three major inventions; (i) refrigeration system with Leo Szilard, (ii)\n",
      "Sound reproduction system with Rudolf Goldschmidt and (iii) automatic camera\n",
      "0.970472209642072 44\n",
      "======\n"
     ]
    }
   ],
   "source": [
    "hybrid_query = '''\n",
    "CALL {\n",
    "    // vector index\n",
    "    CALL db.index.vector.queryNodes('pdf', $k, $question_embedding) YIELD node, score\n",
    "    WITH collect({node:node, score:score}) AS nodes, max(score) AS max\n",
    "    UNWIND nodes AS n\n",
    "    // We use 0 as min\n",
    "    RETURN n.node AS node, (n.score / max) AS score\n",
    "    UNION\n",
    "    // keyword index\n",
    "    CALL db.index.fulltext.queryNodes('ftPdfChunk', $question, {limit: $k})\n",
    "    YIELD node, score\n",
    "    WITH collect({node:node, score:score}) AS nodes, max(score) AS max\n",
    "    UNWIND nodes AS n\n",
    "    // We use 0 as min\n",
    "    RETURN n.node AS node, (n.score / max) AS score\n",
    "}\n",
    "// dedup\n",
    "WITH node, max(score) AS score ORDER BY score DESC LIMIT $k\n",
    "RETURN node, score\n",
    "'''\n",
    "similar_hybrid_records, _, _ = driver.execute_query(hybrid_query, question_embedding=question_embedding, question=question, k=4)\n",
    "\n",
    "for record in similar_hybrid_records:\n",
    "    print(record[\"node\"][\"text\"])\n",
    "    print(record[\"score\"], record[\"node\"][\"index\"])\n",
    "    print(\"======\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "e02679f6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Question: At what time was Einstein really interested in experimental works?\n",
      "Einstein was genuinely interested in experimental works during his days at ETH, as stated in the text."
     ]
    }
   ],
   "source": [
    "user_message = f\"\"\"\n",
    "Use the following documents to answer the question that will follow:\n",
    "{[doc[\"node\"][\"text\"] for doc in similar_hybrid_records]}\n",
    "\n",
    "---\n",
    "\n",
    "The question to answer using information only from the above documents: {question}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Question:\", question)\n",
    "\n",
    "stream = client.chat.completions.create(\n",
    "    model=\"gpt-4\",\n",
    "    messages=[\n",
    "        {\"role\": \"system\", \"content\": system_message},\n",
    "        {\"role\": \"user\", \"content\": user_message}\n",
    "    ],\n",
    "    stream=True,\n",
    ")\n",
    "for chunk in stream:\n",
    "    print(chunk.choices[0].delta.content or \"\", end=\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c3f44158",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.13.12)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
